WMSGIFT/src/Documents/ИзменениеСостоянияРаботниковСклада/ИзменениеСостоянияРаботниковСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеСостоянияРаботниковСклада</name>
  <registerRecords>InformationRegister.СостоянияРаботниковСклада</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеРаботниковСклада</name>
    <type>
      <types>EnumRef.СостоянияСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботникиСклада</name>
    <attributes>
      <name>РаботникСклада</name>
      <type>
        <types>CatalogRef.итWMSРаботникиСклада</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/InformationRegisters/СостоянияРаботниковСклада/СостоянияРаботниковСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияРаботниковСклада</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ВидВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОкончаниеПредположительно</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РаботникСклада</name>
    <type>
      <types>CatalogRef.итWMSРаботникиСклада</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WMSGIFT/src/Documents/ИзменениеСостоянияРаботниковСклада/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СостоянияРаботниковСклада=Движения.СостоянияРаботниковСклада;
	СостоянияРаботниковСклада.Очистить();
	СостоянияРаботниковСклада.Записать();
	Для Каждого  стр из РаботникиСклада Цикл 
		НоваяСтрока=СостоянияРаботниковСклада.Добавить();
		НоваяСтрока.ВидВремени=ВидВремени;
		НоваяСтрока.Состояние=СостояниеРаботниковСклада;
		НоваяСтрока.Организация=Организация;
		НоваяСтрока.РаботникСклада=стр.РаботникСклада;
		НоваяСтрока.Год=НачалоГода(Дата);
	КонецЦикла;
	СостоянияРаботниковСклада.Записать();
КонецПроцедуры
